[AdventLancerArmor X2ArmorTemplate]
FriendlyName="ADVENT Stunlancer Armor"
FriendlyNamePlural="ADVENT Stunlancer Armors"
BriefSummary="Stunlancers appear to wear an equivalent body armor to ADVENT Captains. We discern no clear upgrade since both suits provide the same level of protection. However, the Stunlancer version does offer increased mobility at the cost of eliminating the extra utility storage. This is consistent with their tactical use of melee attacks where closing in on a target is the primary goal. In our version we have managed to conserve the same properties of the original suit."
TacticalText="<Bullet/>Soldiers may take advantage of scavenged ADVENT Stunlancer gear in combat. Additionally, we may catch our enemy off guard with this new armor."


[AdventLancerArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Deception"
LocLongDescription="ADVENT will be less likely to detect this soldier during initial contact."
LocHelpText="ADVENT will be less likely to detect this soldier during initial contact."
LocFlyOverText="ADVENT will be less likely to detect this soldier during initial contact."
LocPromotionPopupText="<Bullet/> ADVENT will be less likely to detect this soldier during initial contact."


[AdventLancerArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Composite Materials"
LocLongDescription="The ADVENT Stunlancer's armor offers increased mobility."
LocHelpText="The ADVENT Stunlancer's armor offers increased mobility."
LocFlyOverText="The ADVENT Stunlancer's armor offers increased mobility."
LocPromotionPopupText="<Bullet/> The ADVENT Stunlancer's armor offers increased mobility."
